Checks whether the SubSchema GUID needs to be explicitly specified for this field type.
  Namespace:   Autodesk.Revit.DB.ExtensibleStorage
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public bool NeedsSubSchemaGUID()
  Visual Basic
Public Function NeedsSubSchemaGUID As Boolean
  Visual C++
public:
bool NeedsSubSchemaGUID()
 Return Value
 True if SubSchemaGUID is required.
 See Also
  FieldBuilder Class
  Autodesk.Revit.DB.ExtensibleStorage Namespace